ZEO/HotfixBranchCode/Zeo/CXN.Xfr/Nexxo.Cxn.MoneyTransfer.WU/Service References/SendMoneyValidation/sendmoneyValidation_Service_H2H.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.westernunion.com/SendMoneyValidate_H2H" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" name="sendmoneyValidation_Service_H2H" targetNamespace="http://www.westernunion.com/SendMoneyValidate_H2H" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema xmlns:mrm="http://www.westernunion.com/SendMoneyValidate" targetNamespace="http://www.westernunion.com/SendMoneyValidate">
      <xsd:import schemaLocation="../schema/XRSISendMoneyValidationRequest.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSISendMoneyValidationReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSIErrorReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="sendmoneyValidation_in">
    <wsdl:part name="send-money-validation-request" element="xrsi:send-money-validation-request" />
  </wsdl:message>
  <wsdl:message name="sendmoneyValidation_out">
    <wsdl:part name="send-money-validation-reply" element="xrsi:send-money-validation-reply" />
  </wsdl:message>
  <wsdl:message name="sendmoneyValidation_fault1">
    <wsdl:part name="error-reply" element="xrsi:error-reply" />
  </wsdl:message>
  <wsdl:portType name="SendMoneyValidatePortType">
    <wsdl:operation name="sendmoneyValidation">
      <wsdl:input name="sendmoneyValidation_Input" message="tns:sendmoneyValidation_in" />
      <wsdl:output name="sendmoneyValidation_Output" message="tns:sendmoneyValidation_out" />
      <wsdl:fault name="sendmoneyValidation_Fault" message="tns:sendmoneyValidation_fault1" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SMValidation_H2H_SOAP_HTTP_Binding" type="tns:SendMoneyValidatePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="sendmoneyValidation">
      <soap:operation soapAction="" />
      <wsdl:input name="sendmoneyValidation_Input">
        <soap:body use="literal" parts="send-money-validation-request" />
      </wsdl:input>
      <wsdl:output name="sendmoneyValidation_Output">
        <soap:body use="literal" parts="send-money-validation-reply" />
      </wsdl:output>
      <wsdl:fault name="sendmoneyValidation_Fault">
        <soap:fault use="literal" name="sendmoneyValidation_Fault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SendmoneyValidation_Service_H2H">
    <wsdl:port name="SOAP_HTTP_Port" binding="tns:SMValidation_H2H_SOAP_HTTP_Binding">
      <soap:address location="http://www.westernunion.com/SendmoneyValidation_Service_H2H" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>