xmlsamples/PI_MTCN/US-SMV-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-validation-request>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>BIN</first_name>
               <last_name>WANG</last_name>
            </name>
            <address>
               <addr_line1>12 ASDFG12</addr_line1>
               <addr_line2>ASDFG12</addr_line2>
               <city>DENVER</city>
               <state>NY</state>
               <postal_code>10001</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>US</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
                  <country_name>United States</country_name>
               </country_code>
               <local_area>FCSS road</local_area>
            </address>
            <compliance_details>
               <template_id>UNI_01</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>Brazil</id_country_of_issue>
                  <id_place_of_issue>Brazil</id_place_of_issue>
                  <id_number>457236589</id_number>
               </id_details>
               <id_issue_date>12062013</id_issue_date>
               <id_expiration_date>04042022</id_expiration_date>
               <date_of_birth>01021963</date_of_birth>
               <occupation>Company Employee</occupation>
               <compliance_comments>-</compliance_comments>
               <transaction_reason>Saving/Investments</transaction_reason>
               <contact_phone>0885604343</contact_phone>
               <Country_of_Birth>Austria</Country_of_Birth>
               <nationality>AUSTRIA</nationality>
               <Gender>F</Gender>
               <Source_of_Funds>Savings</Source_of_Funds>
               <Nature_of_Work_Business>Information Technology</Nature_of_Work_Business>
               <Relationship_to_Receiver_Sender>Friend</Relationship_to_Receiver_Sender>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
               <Country_Code>61</Country_Code>
               <Other_Purpose_of_Transaction>Saving/Investments</Other_Purpose_of_Transaction>
               <is_addr_diff>N</is_addr_diff>
               <employer_status>Employed</employer_status>
               <temporary_address>
                  <addr_line1>232 adoyade</addr_line1>
                  <addr_line2>makkang</addr_line2>
                  <city>mueng</city>
                  <state_code>Victoria</state_code>
                  <postal_code>1120</postal_code>
                  <country>AUSTRIA</country>
               </temporary_address>
               <is_current_and_permanent_addr_same>Y</is_current_and_permanent_addr_same>
            </compliance_details>
            <email>awfasdg.p@opus.com</email>
            <contact_phone>2018212100</contact_phone>
            <date_of_birth>01021963</date_of_birth>
            <place_of_birth>Argentina</place_of_birth>
            <mobile_phone>
               <phone_number>
                  <country_code>351</country_code>
                  <national_number>913041096</national_number>
               </phone_number>
            </mobile_phone>
            <cpf_tax_id>98812779971</cpf_tax_id>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <sms_notification_flag>N</sms_notification_flag>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>ZHAOGUO</first_name>
               <last_name>ZOU</last_name>
            </name>
            <address>
               <addr_line1>100 Summit Ave</addr_line1>
               <postal_code>100102</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
                  <country_name>CHINA</country_name>
               </country_code>
            </address>
            <contact_phone>5632545896</contact_phone>
            <mobile_phone>
               <phone_number></phone_number>
            </mobile_phone>
            <reason_for_sending>P001</reason_for_sending>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>US</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>US</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>Virginia</originating_city>
            <originating_state>FL</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>0</exchange_rate>
         </payment_details>
         <financials>
            <originators_principal_amount>5000</originators_principal_amount>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <consumer_fraud_prompts>
            <question1>N</question1>
         </consumer_fraud_prompts>
         <foreign_remote_system>
            <identifier>USATEST</identifier>
            <reference_no>115210-000000003</reference_no>
            <counter_id>USATEST</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-validation-request>
   </soapenv:Body>
</soapenv:Envelope>