xmlsamples/PI_MTCN/TH-SMV-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-validation-request>
         <channel>
            <type>H2H</type>
            <name>Counter Service</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>Vino</first_name>
               <last_name>tha</last_name>
            </name>
            <address>
               <addr_line1>Mg road</addr_line1>
               <city>LONDON</city>
               <state>LONDON</state>
               <postal_code>12345</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>TH</country_code>
                     <currency_code>THB</currency_code>
                  </iso_code>
                  <country_name>Thailand</country_name>
               </country_code>
               <local_area>LOCALE</local_area>
            </address>
            <compliance_details>
               <template_id>THI_02_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>Thailand</id_country_of_issue>
                  <id_number>123454321</id_number>
               </id_details>
               <id_issue_date>10102010</id_issue_date>
               <id_expiration_date>11112023</id_expiration_date>
               <date_of_birth>02021992</date_of_birth>
               <occupation>Business Owner</occupation>
               <transaction_reason>Family expense</transaction_reason>
               <contact_phone>6623343343</contact_phone>
               <Country_of_Birth>Thailand</Country_of_Birth>
               <nationality>Thailand</nationality>
               <Gender>F</Gender>
               <Does_the_ID_have_an_expiration_date>N</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
               <is_current_and_permanent_addr_same>Y</is_current_and_permanent_addr_same>
            </compliance_details>
            <email>surendra.p@opus.com</email>
            <contact_phone>1785123456789</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>1785</country_code>
                  <national_number>123456789</national_number>
               </phone_number>
            </mobile_phone>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <sms_notification_flag>Y</sms_notification_flag>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>DURGA</first_name>
               <last_name>LAKSHMI</last_name>
            </name>
            <address>
               <addr_line1>corporate drive</addr_line1>
               <country_code>
                  <iso_code>
                     <country_code>IN</country_code>
                     <currency_code>INR</currency_code>
                  </iso_code>
                  <country_name>INDIA</country_name>
               </country_code>
               <local_area>ABCDW</local_area>
               <address_type>D</address_type>
            </address>
            <contact_phone>2018202100</contact_phone>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>TH</country_code>
                  <currency_code>THB</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>IN</country_code>
                  <currency_code>INR</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>TH</country_code>
                  <currency_code>THB</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <taxes>
               <tax_rate>0</tax_rate>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>10000</originators_principal_amount>
            <destination_principal_amount>21285</destination_principal_amount>
            <gross_total_amount>45000</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <pay_amount>21285</pay_amount>
            <charges>35000</charges>
            <tolls>0</tolls>
            <canadian_dollar_exchange_fee>0</canadian_dollar_exchange_fee>
            <message_charge>0</message_charge>
            <money_transfer_limit>4557396670272249888</money_transfer_limit>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGPSTHN450T</identifier>
            <reference_no>1fA1mBOTUuTjCofz</reference_no>
            <counter_id>THN45AKP001A</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-validation-request>
   </soapenv:Body>
</soapenv:Envelope>