xmlsamples/PI_MTCN/JP-SMV-AIS.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:send-money-validation-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <device>
            <id>H2H</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>KYODAI</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>SUCHADA</first_name>
               <last_name>BURANA</last_name>
            </name>
            <address>
               <addr_line1>ASFJALSKJ</addr_line1>
               <city>TOKYO</city>
               <state>TOKYO</state>
               <postal_code>823749</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>JP</country_code>
                     <currency_code>JPY</currency_code>
                  </iso_code>
                  <country_name>JAPAN</country_name>
               </country_code>
            </address>
            <preferred_customer>
               <permanent_change>EnrollWuCard</permanent_change>
            </preferred_customer>
            <compliance_details>
               <template_id>JPN_01</template_id>
               <id_details>
                  <id_type>C</id_type>
                  <id_country_of_issue>JAPAN</id_country_of_issue>
                  <id_number>141421356</id_number>
               </id_details>
               <third_party_details>            
						<flag_pay>N</flag_pay>          
					</third_party_details>
               <id_expiration_date>24042025</id_expiration_date>
               <date_of_birth>01011980</date_of_birth>
               <occupation>Student</occupation>
               <transaction_reason>Migrant Remittance</transaction_reason>
               <Country_of_Birth>CHINA</Country_of_Birth>
               <Relationship_to_Receiver_Sender>Employee/Employer</Relationship_to_Receiver_Sender>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>x</ack_flag>
            </compliance_details>
            <contact_phone>87654321</contact_phone>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <bank_details>
               <name>JSB</name>
               <account_number>0211999</account_number>
               <routing_number>123</routing_number>
               <account_type>Savings</account_type>
            </bank_details>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>DENISAWA</first_name>
               <last_name>ALLERTOVA</last_name>
            </name>
            <address>
               <addr_line1>ASFJALSKJ</addr_line1>
               <city>Beijing</city>
               <state>Beijing</state>
               <postal_code>100102</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
                  <country_name>China</country_name>
               </country_code>
            </address>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>co</state_code>
               <city>shoushi</city>
            </expected_payout_location>
            <recording_country_currency>
               <iso_code>
                  <country_code>JP</country_code>
                  <currency_code>JPY</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>TH</country_code>
                  <currency_code>THB</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>JP</country_code>
                  <currency_code>JPY</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <pay_wo_id_indicator>0</pay_wo_id_indicator>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <originators_principal_amount>100</originators_principal_amount>
            <destination_principal_amount>65400</destination_principal_amount>
         </financials>
         <delivery_services>
            <code>000</code>
            <message>
               <message_details context="3">
                  <text>Hello</text>
               </message_details>
            </message>
         </delivery_services>
         <bank_details>
            <name>JAPAN SEVEN BANK</name>
            <account_number>H3H589970</account_number>
         </bank_details>
         <foreign_remote_system>
            <identifier>WGHHJPAP10P</identifier>
            <reference_no>20001287</reference_no>
            <counter_id>JPAP1ARP001A</counter_id>
         </foreign_remote_system>
      </ns2:send-money-validation-request>
   </soap:Body>
</soap:Envelope>